---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitConnectionTypeParam
source: html/dd70bc80-b54d-7c2b-ee4e-49b98a2b9b2d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecCircuitConnectionTypeParam Property

"Connection Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecCircuitConnectionTypeParam { get; }
```